Revit 2026 API

# IndexBuffer Properties

---

The IndexBuffer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

IndexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace